#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "rus");
	////zadanie 1

	//int a;
	//char b;
	//cout << "введите что либо:\n";
	//cin >> b;
	//a = (int)b;
	//if (((a >= 65) && (a <= 90)) || ((a >= 97) && (a <= 122))){
	//	cout << "это буковка";
	//}
	//else if ((a >= 48) && (a <= 57)){
	//	cout << "это циферка";
	//}
	//else if ((a == 33) || ((a >= 44) && (a <= 46)) || (a == 58) || (a == 59) || (a == 63)){
	//	cout << "это знак препинания";
	//}
	//else
	//{
	//	cout << "Ошибка";
	//}
	
	////zadanie 2
	//
	//int t, op1, op2;
	//float HTC, Gigaphone, Tele3;
	//HTC = 2;
	//Gigaphone = 4;
	//Tele3 = 3;
	//do {
	//	cout << "НТС - 1, Гигафон - 2, Теле3 - 3" << endl;
	//	cout << "У вас:";
	//	cin >> op1;
	//	cout << "У собеседника: ";
	//	cin >> op2;
	//	if (op1 < 1 || op1 > 3 || op2 < 1 || op2 > 3) {
	//		cout << "Ошибка";
	//	}
	//} while (op1 < 1 || op1 > 3 || op2 < 1 || op2 > 3);
	//if (op1 == op2) {
	//	cout << "Счет: 0 Руб";
	//	return 0;
	//}
	//cout << "Сколько вы собираетесь разговаривать(в минутах): ";
	//cin >> t;
	//if (op1 == 1) {
	//	cout << "Счет:" << t * HTC << "РУБ";
	//	return 0;
	//}
	//if (op1 == 2) {
	//	cout << "Счет:" << t * Gigaphone << "РУБ";
	//	return 0;
	//}
	//if (op1 == 3) {
	//	cout << "Счет:" << t * Tele3 << "РУБ";
	//	return 0;
	//}


	\




	//zadanie 3.1
	int z, op, k;

	cout << "Сколько Вася хочет?: ";
	cin >> z;
	do {
		cout << "Сколько опозданий?: ";
		cin >> op;
		if (op < 0) {
			cout << "Ошибка";
		}
	} while (op < 0);
	if (op < 3) {
		cout << "Вася напишет"<< z * 2 <<"строчек кода" << endl;
	}
	if (op >= 3) {
		cout << "Вася напишет" << (z * 2) + ((op / 3) * 40) << "строчек кода" << endl;
	}

	//zadanie 3.2

	do {
		cout << "Сколько строчек кода написал Вася?: ";
		cin >> k;
		cout << "Сколько он хочет зарабатывать?: ";
		cin >> z;
		if ((((k - (z * 2)) / 20) / 3) < 0) {
			cout << "Васю уволили, press f" << endl;
		}
	} while ((((k - (z * 2)) / 20) / 3) < 0);
	if ((((k - (z * 2)) / 20) / 3) >= 0)
		cout << "Вася максимум опаздает: " << ((((k - (z * 2)) / 2) / 3)-1) << "раз" << endl;

	// zadanie 3.3

	cout << "Сколько строчек кода написал Вася?: ";
	cin >> k;
	cout << "Сколько Вася опоздал: ";
	cin >> op;
	if ((k / 2) < ((op / 3) * 20)) {
		cout << "Вася будет должен: " << ((op / 3) * 20) - (k / 2) << "$ + шоколадку";
		return 0;
	}
	if ((k / 2) == ((op / 3) * 20)) {
		cout << "Вася ниче не получит";
		return 0;
	}
	if ((k / 2) > ((op / 3) * 20)) {
		cout << "Вася получит: " << ((k / 2) - ((op / 3) * 20)) << "$";
		return 0;
	}



}